In [1]:
import pandas as pd
import numpy as np
import scipy.stats as st
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
ls

Lab Inferential statistics.ipynb  machine.txt
anova_lab_data.xlsx               pokemon.csv
lab_data.png                      student_gpa.txt

read_csv('file.csv', sep = '\t') or |, , /, \t

In [21]:
machine = pd.read_csv("machine.txt", encoding = "utf-16", sep = "\t", names = ["New", "Old"], header=0) # Specifying the field separator.

In [24]:
machine.head(12)

    New   Old
0  42.1  42.7
1  41.0  43.6
2  41.3  43.8
3  41.8  43.3
4  42.4  42.5
5  42.8  43.5
6  43.2  43.1
7  42.3  41.7
8  41.8  44.0
9  42.7  44.1

In [25]:
machine.describe()

             New        Old
count  10.000000  10.000000
mean   42.140000  43.230000
std     0.683455   0.749889
min    41.000000  41.700000
25%    41.800000  42.800000
50%    42.200000  43.400000
75%    42.625000  43.750000
max    43.200000  44.100000

#independent sample

In [31]:
print('p value (single tailed): ',st.ttest_1samp(machine['New'],43.23)[1]/2)

p value (single tailed):  0.0003483188038379669

#We reject the null hypothesis. p_value < 0.05/2

I think that there is not sufficient evidence to show if one machine is better than the other, because when I apply describe() function I can see the mean of the new it is better than the old machine.

In [ ]:
#Matched Pairs

In [32]:
pokemon = pd.read_csv("pokemon.csv")
print(pokemon.shape)
pokemon.head()

(800, 13)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [33]:
pokemon.describe().T

            count       mean         std    min     25%    50%     75%    max
#           800.0  362.81375  208.343798    1.0  184.75  364.5  539.25  721.0
Total       800.0  435.10250  119.963040  180.0  330.00  450.0  515.00  780.0
HP          800.0   69.25875   25.534669    1.0   50.00   65.0   80.00  255.0
Attack      800.0   79.00125   32.457366    5.0   55.00   75.0  100.00  190.0
Defense     800.0   73.84250   31.183501    5.0   50.00   70.0   90.00  230.0
Sp. Atk     800.0   72.82000   32.722294   10.0   49.75   65.0   95.00  194.0
Sp. Def     800.0   71.90250   27.828916   20.0   50.00   70.0   90.00  230.0
Speed       800.0   68.27750   29.060474    5.0   45.00   65.0   90.00  180.0
Generation  800.0    3.32375    1.661290    1.0    2.00    3.0    5.00    6.0

In [36]:
st.ttest_rel(pokemon['Attack'], pokemon['Defense'])

Ttest_relResult(statistic=4.325566393330478, pvalue=1.7140303479358558e-05)

In [ ]:
#We reject the null hypothesis. p_value < 0.05/2

## OPTIONAL PART | Inferential statistics - ANOVA

In this activity, we will look at another example. Your task is to understand the problem and write down all the steps to set up ANOVA. After the next lesson, we will ask you to solve this problem using Python. Here are the steps that you would need to work on: - Null hypothesis - Alternate hypothesis - Level of significance - Test statistic - P-value - F table

Context
Suppose you are working as an analyst in a microprocessor chip manufacturing plant. You have been given the task of analyzing a plasma etching process with respect to changing Power (in Watts) of the plasma beam. Data was collected and provided to you to conduct statistical analysis and check if changing the power of the plasma beam has any effect on the etching rate by the machine. You will conduct ANOVA and check if there is any difference in the mean etching rate for different levels of power. You can find the data anova_lab_data.xlsx file in the files_for_lab folder

State the null hypothesis
State the alternate hypothesis
What is the significance level
What are the degrees of freedom of model, error terms, and total DoF
Data was collected randomly and provided to you in the table as shown: link to the image - Data

$$H0: \mu_{1} = \mu_{2}$$
$$H1: \mu_{1} \neq \mu_{2}$$

In [ ]:
# H0 => Plasma etching = power(watts)
# H1 => Plasma etching != power(watts)
# level of significance (alpha) => 0.05
# Test statistic: 36.87895470100505
# P-value: 7.506584272358903e-06

In [50]:
anova = pd.read_excel('anova_lab_data.xlsx')
print(anova.shape)
anova.head()

(15, 2)

  Power   Etching Rate
0  160 W          5.43
1  180 W          6.24
2  200 W          8.79
3  160 W          5.71
4  180 W          6.71

In [51]:
anova.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Power         15 non-null     object
 1   Etching Rate  15 non-null     float64
dtypes: float64(1), object(1)
memory usage: 368.0+ bytes

In [52]:
anova.head()

  Power   Etching Rate
0  160 W          5.43
1  180 W          6.24
2  200 W          8.79
3  160 W          5.71
4  180 W          6.71

In [55]:
anova['Power_rate'] = anova.groupby('Power ').cumcount() #is the new index 

anova_pivot = anova.pivot(index='Power_rate', columns='Power ', values='Etching Rate')
#anova_pivot
anova_pivot.columns = ['Power_'+str(x) for x in anova_pivot.columns.values]
anova_pivot.head(10)

            Power_160 W  Power_180 W  Power_200 W
Power_rate
0                  5.43         6.24         8.79
1                  5.71         6.71         9.20
2                  6.22         5.98         7.90
3                  6.01         5.66         8.15
4                  5.59         6.60         7.55

In [58]:
st.f_oneway(anova_pivot['Power_160 W'],anova_pivot['Power_180 W'],anova_pivot['Power_200 W'])

F_onewayResult(statistic=36.87895470100505, pvalue=7.506584272358903e-06)

In [59]:
anova_pivot.mean()

Power_160 W    5.792
Power_180 W    6.238
Power_200 W    8.318
dtype: float64

In [ ]:
#We reject the null hypothesis. p_value < 0.05